Revit 2027 API
ParameterTypeId.FabricationProductEntry Property
 "Product Entry"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductEntry { get; }
Public Shared ReadOnly Property FabricationProductEntry As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductEntry {
	ForgeTypeId^ get ();
}
static member FabricationProductEntry : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace